Revit 2026 API

# HemisphericalLightDistribution(HemisphericalLightDistribution) Constructor

---

Creates a copy of the given hemispherical light distribution

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public HemisphericalLightDistribution(
	HemisphericalLightDistribution other
)
```
```vb
Public Sub New (
	other As HemisphericalLightDistribution
)
```
```cpp
public:
HemisphericalLightDistribution(
	HemisphericalLightDistribution^ other
)
```
```fsharp
new :
        other : HemisphericalLightDistribution -> HemisphericalLightDistribution
```

#### Parameters

other HemisphericalLightDistribution

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

HemisphericalLightDistribution Class

HemisphericalLightDistribution Overload

Autodesk.Revit.DB.Lighting Namespace